#+Title: Cordova Lista de Contatos


* Tema
  Acessando lista de contatos com cordova
* Objetivo
  Compreender o mecanismo de acesso a lista de contato utilizando
  cordova plugin

* Duração
  2Blocos

* Pré-Requisitos
** Conhecimentos Prévios
   Basicao de Cordova e javascript

** Recursos
   Instalar o plugin do cordova
   
   #+NAME:cordova plugin add org.apache.cordova.contacts
   #+BEGIN_SRC shell :session s1 :results output :exports both
      cordova plugin add org.apache.cordova.contacts
   #+END_SRC


* Procedimento didatico
** Explanação Introdutória do professora
** Parte Prática
*** Criação do projeto
    Crie o seu projeto
    Instale o plugin

* Exercicios e Atividades de Reflexão/Fixação
* Avaliação
* Referencias




* Plugin cordova-plugin-contacts
  

* Criando um projeto
  
   #+NAME:  rm -rf projetos/cordova_proj1                    
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      rm -rf projetos/cordova_proj4_contatos
   #+END_SRC

   #+RESULTS: rm -rf projetos/cordova_proj1

  #+NAME: cordova create proj                     
  #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code      
      cordova create projetos/cordova_proj4_contatos br.edu.eteczl "Proj4 Contatos"      
      export projDir=projetos/cordova_proj4_contatos
  #+END_SRC

  #+RESULTS: cordova create proj
  : 
  : Creating a new cordova project.[0m

   #+NAME: ls projeto                  
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      ls $projDir
   #+END_SRC

   #+RESULTS: ls projeto
   : 
   : config.xml  hooks  package.json  platforms  plugins  res  www


   
   #+NAME: add platform e camera                    
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $projDir      
      cordova platform add browser 
      cordova platform add android 
      cordova plugin add cordova-plugin-contacts
   #+END_SRC

   #+RESULTS: add platform e camera
   #+begin_example

   [wagner@localhost cordova_proj4_contatos]$ Using cordova-fetch for cordova-browser@~5.0.1[0m
   Adding browser project...[0m
   Creating Cordova project for cordova-browser:[0m
           Path: /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/aulas_de_cordova/projetos/cordova_proj4_contatos/platforms/browser[0m
           Name: Proj4 Contatos[0m
   Discovered plugin "cordova-plugin-whitelist" in config.xml. Adding it to the project[0m
   Installing "cordova-plugin-whitelist" for browser[0m
   Adding cordova-plugin-whitelist to package.json[0m
   Saved plugin info for "cordova-plugin-whitelist" to config.xml[0m
   --save flag or autosave detected[0m
   Saving browser@~5.0.4 into config.xml file ...[0m
   Using cordova-fetch for cordova-android@~7.1.1[0m
   Adding android project...[0m
   Creating Cordova project for the Android platform:[0m
           Path: platforms/android[0m
           Package: br.edu.eteczl[0m
           Name: Proj4_Contatos[0m
           Activity: MainActivity[0m
           Android target: android-27[0m
   Android project created with cordova-android@7.1.4[0m
   Android Studio project detected[0m
   Android Studio project detected[0m
   Installing "cordova-plugin-whitelist" for android[0m

                  This plugin is only applicable for versions of cordova-android greater than 4.0. If you have a previous platform version, you do *not* need this plugin since the whitelist will be built in.
             [0m
   --save flag or autosave detected[0m
   Saving android@~7.1.4 into config.xml file ...[0m
   Installing "cordova-plugin-contacts" for android[0m
   Android Studio project detected[0m
   Installing "cordova-plugin-contacts" for browser[0m
   Adding cordova-plugin-contacts to package.json[0m
   Saved plugin info for "cordova-plugin-contacts" to config.xml[0m
   #+end_example

   #+NAME: adb devices                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      adb devices
   #+END_SRC

   #+RESULTS: adb devices
   : 
   : List of devices attached
   : c1ca8fb	device

   #+NAME: cordova plugin list                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $projDir
      cordova plugin list
   #+END_SRC

   #+RESULTS: cordova plugin list
   : 
   : bash: cd: projetos/cordova_proj4_contatos: No such file or directory
   : cordova-plugin-contacts 3.0.1 "Contacts"
   : cordova-plugin-whitelist 1.3.3 "Whitelist"[0m


   
   #+NAME:  cordova run android 1                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cordova run android
   #+END_SRC


* referencias
  https://cordova.apache.org/docs/en/latest/reference/cordova-plugin-camera/#module_Camera.PictureSourceType


